---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FormFailures.AddProfileFailure
source: html/34d6f4a1-becc-04f8-996f-a8ecfb932e14.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FormFailures.AddProfileFailure Property

Failed to Add Profile

## Syntax (C#)
```csharp
public static FailureDefinitionId AddProfileFailure { get; }
```